package com.gxy.tree;


/**
 * 二叉树
 * 
 * 树是一种典型的数据结构，它有很多种重要的应用。树提供了一种层次组织结构数据可以存储在树种的每个结点内。
 * 
 * 线性表、栈或队列都是由一系列元素构成的线性结构。
 * 二叉树是一种层次结构，它要么是空集，要么是由一个称为根的元素和两颗不同二叉树组成的，
 * 这两颗二叉树分别称为左子树和右子树。允许这两颗子树中的一颗或者两颗为空。
 * 
 * 一条路径的长度是指在该路径上的边的个数。
 * 一个结点的深度是指从根结点到该结点的路径长度。
 * 有时候，我们将一棵树中具有某个给定深度的所有节点的集合称为该树的一层。
 * 兄弟结点是共享一个父结点的结点。
 * 一个结点的左(右)子树的根节点称为这个结点的左(右)孩子。
 * 没有孩子的结点称为叶结点。
 * 空树的高度为0。
 * 非空树的高度是从根结点到它的最远叶子结点的路径长度+1。
 * 
 * 
 * 二叉查找树：对于数种的每一个结点，它的左子树中结点的值都小于该结点的值，而它的右子树中结点的值都大于该结点的值。
 * 
 * @author gxy
 * @date 2016年2月4日下午7:31:53
 */

public class 二叉树介绍 {

}
